[
  {
    "id": 1,
    "title": "Online Learning Portal",
    "img": "/images/home.png",
    "liveLink": "https://lws-learningprotal.netlify.app/",
    "gitClientLink": "https://github.com/saju575/Learning_Protal",
    "gitServerLink": "https://github.com/saju575/Online-Learning-Portal-JSON-API",
    "description": "Online Learning Portal is a comprehensive website designed for focused course-based learning.",
    "functionality": [
      "Video page for viewing educational videos and submitting quizzes and assignments.",
      "Once a quiz or assignment is submitted, students cannot retake it for that specific video.",
      "Leaderboard showcasing the top 20 student marks for quizzes and assignments.",
      "Admin panel for administrators to add videos, assignments, quizzes, and grade student submissions."
    ],
    "category": "frontend",
    "frontendTechnology": ["React.js", "Tailwind", "Redux", "React-router-dom"],
    "backendTechnology": ["JSON server", "JSON server auth"]
  },
  {
    "id": 2,
    "title": "Grocery Stock",
    "img": "/images/1.png",
    "liveLink": "https://grosery-inventory.web.app/",
    "gitClientLink": "https://github.com/saju575/Grosary_Stock",
    "gitServerLink": "https://github.com/saju575/Grocery-API",
    "description": "This website serves as an information hub for Grosary Stock, designed specifically for dealers and not as a client-facing website.It provides valuable insights into the inventory, including the availability of various products, as well as tracking the number of sold items. Additionally, the website enables dealers to perform essential operations such as adding, deleting, and delivering products.",
    "functionality": [
      "Developed a Grocery Stock website to manage inventory and dealer information.",
      "Implemented features to track product availability, sales, and delivery.",
      "In home page shows some top items available and products summaries.",

      "Connected the website with the backend, allowing dealer to add, delete, and update items.",
      "Restricted access to the inventory page and product details to logged-in users only.",
      "Created a Sold information table page to track sales."
    ],
    "category": "full-stack",
    "frontendTechnology": [
      "React.js",
      "React Router",
      "Tailwind",
      "Firebase",
      "react-helmet-async",
      "recharts",
      "Fontawesome"
    ],
    "backendTechnology": ["Express.js", "MongoDB", "JWT"]
  }
]
